name: "bge_embeddings"
backend: "python"
max_batch_size: 16

input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "embeddings"
    data_type: TYPE_FP32
    dims: [ 768 ]
  }
]

# CPU-only instance for K8s deployment
instance_group [
  {
    count: 2
    kind: KIND_CPU
  }
]

# Dynamic batching for efficiency
dynamic_batching {
  preferred_batch_size: [ 2, 4, 8 ]
  max_queue_delay_microseconds: 100000
}
